app/Controllers/Agendaris.php

SELECT `jenis`
FROM `agendaris`
WHERE jenis IS NOT NULL
AND `jenis` != ''
GROUP BY `jenis`
ORDER BY `jenis` ASC
SELECT COUNT(*) AS `numrows`
FROM `agendaris`
SELECT `agendaris`.*
FROM `agendaris`
ORDER BY `agendaris`.`created_at` ASC, `agendaris`.`id` ASC
 LIMIT 10
---
            $this->model->where('agendaris.tanggal_diterima <=', $to);
        }

        $jenisOptions = db_connect()->table('agendaris')
            ->select('jenis')
            ->where('jenis IS NOT NULL', null, false)
            ->where('jenis !=', '')
            ->groupBy('jenis')
            ->orderBy('jenis', 'ASC')
            ->get()
            ->getResultArray();

        return view('agendaris/index', [
            'title'   => 'Surat Masuk',
            'agenda'  => $this->model->orderBy('agendaris.created_at', 'ASC')->orderBy('agendaris.id', 'ASC')->paginate($perPage, 'agendaris'),

SELECT `agendaris`.*, `dokumen_masuk`.`penyerahan_at`
FROM `agendaris`
LEFT JOIN `dokumen_masuk` ON `dokumen_masuk`.`id` = `agendaris`.`dokumen_masuk_id`
WHERE `agendaris`.`id` = 77
---
    private function findJoined(int $id): array
    {
        $row = db_connect()->table('agendaris')
            ->select('agendaris.*, dokumen_masuk.penyerahan_at')
            ->join('dokumen_masuk', 'dokumen_masuk.id = agendaris.dokumen_masuk_id', 'left')
            ->where('agendaris.id', $id)
            ->get()
            ->getRowArray();