app/Controllers/Dashboard.php

SELECT DATE_FORMAT(tanggal, '%Y-%m') AS periode, COUNT(*) AS total
FROM `dokumen_masuk`
WHERE `deleted_at` IS NULL
AND `tanggal` >= '2026-03-01'
GROUP BY `periode`
ORDER BY `periode` ASC
SELECT COUNT(*) AS `numrows`
FROM `dokumen_masuk`
WHERE `deleted_at` IS NULL
SELECT `jenis` AS `label`, COUNT(*) AS total
FROM `dokumen_masuk`
WHERE `deleted_at` IS NULL
GROUP BY `jenis`
ORDER BY `total` DESC
 LIMIT 5
---
    public function index(): string
    {
        $db    = db_connect();
        $today = date('Y-m-d');
        $month = date('Y-m');
        $base  = static fn () => $db->table('dokumen_masuk')->where('deleted_at', null);

        $monthlyRows = $base()
            ->select("DATE_FORMAT(tanggal, '%Y-%m') AS periode, COUNT(*) AS total", false)
            ->where('tanggal >=', date('Y-m-01', strtotime('-5 months')))
            ->groupBy('periode')
            ->orderBy('periode', 'ASC')
            ->get()
            ->getResultArray();

        $monthlyMap = array_column($monthlyRows, 'total', 'periode');
        $monthNames = ['Jan', 'Feb', 'Mar', 'Apr', 'Mei', 'Jun', 'Jul', 'Agu', 'Sep', 'Okt', 'Nov', 'Des'];
        $chart       = [];

        for ($i = 5; $i >= 0; $i--) {
            $timestamp = strtotime("-{$i} months");
            $key       = date('Y-m', $timestamp);
            $chart[]   = [
                'label' => $monthNames[(int) date('n', $timestamp) - 1],
                'total' => (int) ($monthlyMap[$key] ?? 0),
            ];
        }

        $jenis = $base()
            ->select('jenis AS label, COUNT(*) AS total')
            ->groupBy('jenis')
            ->orderBy('total', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();