app/Controllers/DistribusiDokumen.php

            'dokumenKeluar'  => $outgoing->orderBy('distribusi_dokumen.id', 'ASC')->paginate($perPage, 'distribusi_keluar'),
            'pagerKeluar'    => $outgoing->pager,
            'filters'        => compact('keyword', 'from', 'to', 'perPage'),
            'totalData' => $db->table('dokumen_masuk')
                ->where('deleted_at', null)
                ->groupStart()
                ->where('pengambilan', null)
                ->orWhere('pengambilan', '')
                ->groupEnd()
                ->countAllResults(),
            'totalKeluar' => $db->table('distribusi_dokumen')
                ->join('dokumen_keluar', 'dokumen_keluar.id = distribusi_dokumen.dokumen_keluar_id', 'inner')
                ->where('dokumen_keluar.progres !=', 'Diambil Ekspedisi')
                ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `dokumen_masuk`
WHERE `deleted_at` IS NULL
AND   (
`pengambilan` IS NULL
OR `pengambilan` = ''
 )
SELECT COUNT(*) AS `numrows`
FROM `dokumen_keluar`
INNER JOIN `distribusi_dokumen` ON `distribusi_dokumen`.`dokumen_keluar_id` = `dokumen_keluar`.`id`
WHERE `dokumen_keluar`.`progres` != 'Diambil Ekspedisi'
SELECT COUNT(*) AS `numrows`
FROM `distribusi_dokumen`
INNER JOIN `dokumen_keluar` ON `dokumen_keluar`.`id` = `distribusi_dokumen`.`dokumen_keluar_id`
WHERE `dokumen_keluar`.`progres` != 'Diambil Ekspedisi'