app/Controllers/DokumenMasuk.php

SELECT `jenis`
FROM `dokumen_masuk`
WHERE `deleted_at` IS NULL
GROUP BY `jenis`
ORDER BY `jenis` ASC
SELECT *
FROM `dokumen_masuk`
WHERE `dokumen_masuk`.`deleted_at` IS NULL
ORDER BY `created_at` ASC, `id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `dokumen_masuk`
WHERE `dokumen_masuk`.`deleted_at` IS NULL
---
            $this->model->where('tanggal <=', $to);
        }

        $jenisOptions = db_connect()->table('dokumen_masuk')
            ->select('jenis')
            ->where('deleted_at', null)
            ->groupBy('jenis')
            ->orderBy('jenis', 'ASC')
            ->get()
            ->getResultArray();

        return view('dokumen_masuk/index', [
            'title'   => 'Dokumen Masuk',
            'dokumen' => $this->model->orderBy('created_at', 'ASC')->orderBy('id', 'ASC')->paginate($perPage, 'dokumen_masuk'),