app/Controllers/DokumenKeluar.php

            'indexUrl'     => $indexUrl,
            'detailUrlPrefix' => $securityView ? 'dokumen-keluar' : 'agendaris/surat-keluar',
            'readOnly'     => $securityView,
            'dokumen'      => $this->model->orderBy('id', 'ASC')->paginate($perPage, 'dokumen_keluar'),
---
SELECT *
FROM `dokumen_keluar`
ORDER BY `id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `dokumen_keluar`